export const data = [
  {
    title: "Nextjs چگونه به SEO سایت شما کمک می‌کند؟",
    summery:
      "از هنگامی که موتورهای جست و جو مانند گوگل در میان استفاده‌کنندگان اینترنت مشهور شد تا کنون، SEO برای شرکت‌ها و به خصوص برنامه ‌نویس‌های وب از اهمیت زیادی برخوردار بوده ‌است. اینکه زمان جست و جو برای یک عبارت، وبسایت شما در میان اولین گزینه‌های پیشنهادی موتورهای جست و جو باشد، یک عامل موثر در پیشرفت و دیده شدن وبسایت شماست. در این مقاله به بررسی تاثیر فریمورک محبوب Nextjs بر SEO خواهیم پرداخت",
    urlPath: "how_does_nextjs_help_seo_of_your_site",
    id: 1,
  },
];

export const articles = [
  {
    id: 1,
    title: "Nextjs چگونه به SEO سایت شما کمک می‌کند؟",
    body: [
      {
        id: 0,
        detail:
          "از هنگامی که موتورهای جست و جو مانند گوگل در میان استفاده‌کنندگان اینترنت مشهور شد تا کنون، SEO برای شرکت‌ها و به خصوص برنامه ‌نویس‌های وب از اهمیت زیادی برخوردار بوده ‌است. اینکه زمان جست و جو برای یک عبارت، وبسایت شما در میان اولین گزینه‌های پیشنهادی موتورهای جست و جو باشد، یک عامل موثر در پیشرفت و دیده شدن وبسایت شماست. در این مقاله به بررسی تاثیر فریمورک محبوب Nextjs بر SEO خواهیم پرداخت.",
      },
      {
        id: 1,
        topic: "موتورهای جست و جو چگونه وبسایت شما را پیدا می‌کنند؟",
        detail:
          "قبل از اینکه به بررسی تاثیر Nextjs بپردازیم اول لازم است بدانیم که موتورهای جست و جو چگونه وبسایت شما را پیدا می‌کنند.",
      },
      {
        id: 2,
        topic: "Web crawlerها چه هستند؟",
        detail:
          "Web crawlerها ربات‌هایی هستند که توسط موتورهای جست و جو استفاده می‌شوند. وظیفه اصلی آن‌ها این است که محتوای وبسایت‌ها را بررسی کنند و پس از اجرای یک سری الگوریتم موتورهای جست و جو می‌توانند یک سری لینک مرتبط با عبارت جست و جوی کاربر یپدا کنند.",
      },
      {
        id: 3,
        topic: "Web crawlerها چگونه کار می‌کنند؟",
        detail:
          "هیچکس تعداد وبسایت‌های موجود در بستر اینترنت را نمی‌داند. Web crawlerها هم از این مسئله مستثنی نیستند. پس آن‌ها چگونه وبسایت‌های متفاوت را پیدا و بررسی می‌کنند؟ Web crawlerها در واقع جست و جوی خود را از یک سری URL شناخته شده آغاز می‌کنند(seed URLs). سپس crawlerها URLهایی که در آن صفحه قرار دارند را بررسی می‌کنند و این فرآیند به صورت بازگشتی ادامه دارد. از آنجایی که این فرآیند ممکن است تا ابد ادامه‌دار باشد crawlerها به صورت انتخابی URLها را بررسی می‌کنند. بحث درباره crawlerها خود نیازمند یک مقاله جداگانه است و در این مقال نمی‌گنجد. شاید وقتی دیگر.",
      },
      {
        id: 4,
        topic: "خب، این‌ها صحیح؛ مشکل کجاست؟",
        detail:
          "به طور کلی SPA(single page app)ها مانند Reactjs به این صورت عمل می‌کنند که فایل html و js توسط سرور به مرورگر کاربر ارسال شده و مرورگر شروع به دانلود کردن این فایل‌ها می‌کند و تا هنگامی که این فرآیند به اتمام نرسد، کاربر در مرورگر خود چیزی مشاهده نمی‌کند. علاوه بر آن محتوای فایل html بر اساس محتوای فایل(ها)یjs مشخص می‌شود. این فرآیند همانطور که به نظر می‌رسد اندکی زمان‌بر است. اما Web crawlerها منابع محدودی هم از نظر زمان و هم از نظر حافظه دارند و عموما صبر نمی‌کنند تا تمام صفحات به صورت کامل لود شوند. این به معنای این است که امکان دارد Web crawlerها به این نتیجه برسند که صفحه اصلی سایت شما فقط دارای یک عبارت is loading است.",
      },
      {
        id: 5,
        topic: "Nextjs چگونه به حل این مسئله کمک می‌کند؟",
        detail:
          "Nextjs برای حل این موضوع از تکنیکی به نام pre-rendering استفاده می‌کند. در pre-rendering برخلاف شیوه‌ای که گفته شد، Nextjs یک فایل htmlمینیمال را در سمت سرور ساخته و سپس آن را همراه کدهایjs به سمت کاربر می‌فرستد. وقتی که html اولیه توسط مرورگر کاربر لود شد، کدهایjs هم اجرا می‌شوند و صفحه به طور کامل آماده استفاده ‌می‌شود(این فرآیند اصطلاحا Hydration نام دارد). وقتی که از pre-rendering استفاده شود، web crawlerها برای بررسی محتوای یک صفحه نیازی به تولیدhtml ندارند و محتویات صفحه به صورت دقیق‌تر در اختیار آن‌ها قرار می‌گیرد. Pre-rendering دارای انواع متفاوتی است که خود موضوع جداگانه‌ای است. این هم شاید وقتی دیگر.",
      },
      {
        id: 6,
        topic: "قصه ما به سر رسید؟",
        detail:
          "خیر. این تصور که با صرف استفاده از Nextjs و pre-rendering سایت شما از نظر SEO به حد کمال می‌رسد اشتباه است و SEO به عوامل دیگری نیز بستگی دارد.",
      },
    ],
  },
];
